---
kind: method
id: M:Autodesk.Revit.DB.FaceArray.ReverseIterator
source: html/71a506f1-4b51-9c1a-ed04-c285769c22a3.htm
---
# Autodesk.Revit.DB.FaceArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual FaceArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.